## Handling Missing Values

In [1]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName("PracticeMissingValues").getOrCreate()

In [6]:
## Reading CSV file
df = spark.read.csv("data/test2.csv", header=True, inferSchema=True)

In [4]:
df.show()
df.printSchema()

+-------+----+----------+-------+
|   Name| age|experience| salary|
+-------+----+----------+-------+
| Insram|26.0|         3| 250000|
|Shakeel|26.0|         4| 256000|
|  Shabi|25.0|         5|2570000|
|    Ali|18.0|         1|  25000|
|  Ahmed|15.0|         1| 150000|
|   NULL|45.0|      NULL|  56690|
| Kamran|54.0|      NULL|   NULL|
|   NULL|NULL|      NULL|  90000|
+-------+----+----------+-------+

root
 |-- Name: string (nullable = true)
 |-- age: double (nullable = true)
 |-- experience: integer (nullable = true)
 |-- salary: integer (nullable = true)

In [7]:
## Drop a column
df.drop("salary").show()

+-------+----+----------+
|   Name| age|experience|
+-------+----+----------+
| Insram|26.0|         3|
|Shakeel|26.0|         4|
|  Shabi|25.0|         5|
|    Ali|18.0|         1|
|  Ahmed|15.0|         1|
|   NULL|45.0|      NULL|
| Kamran|54.0|      NULL|
|   NULL|NULL|      NULL|
+-------+----+----------+

In [8]:
df.show()

+-------+----+----------+-------+
|   Name| age|experience| salary|
+-------+----+----------+-------+
| Insram|26.0|         3| 250000|
|Shakeel|26.0|         4| 256000|
|  Shabi|25.0|         5|2570000|
|    Ali|18.0|         1|  25000|
|  Ahmed|15.0|         1| 150000|
|   NULL|45.0|      NULL|  56690|
| Kamran|54.0|      NULL|   NULL|
|   NULL|NULL|      NULL|  90000|
+-------+----+----------+-------+

In [9]:
## Drop null values
df.na.drop().show()

+-------+----+----------+-------+
|   Name| age|experience| salary|
+-------+----+----------+-------+
| Insram|26.0|         3| 250000|
|Shakeel|26.0|         4| 256000|
|  Shabi|25.0|         5|2570000|
|    Ali|18.0|         1|  25000|
|  Ahmed|15.0|         1| 150000|
+-------+----+----------+-------+

In [10]:
## Drop missing values with how 
df.na.drop(how="all").show()
df.na.drop(how="any").show()

+-------+----+----------+-------+
|   Name| age|experience| salary|
+-------+----+----------+-------+
| Insram|26.0|         3| 250000|
|Shakeel|26.0|         4| 256000|
|  Shabi|25.0|         5|2570000|
|    Ali|18.0|         1|  25000|
|  Ahmed|15.0|         1| 150000|
|   NULL|45.0|      NULL|  56690|
| Kamran|54.0|      NULL|   NULL|
|   NULL|NULL|      NULL|  90000|
+-------+----+----------+-------+

+-------+----+----------+-------+
|   Name| age|experience| salary|
+-------+----+----------+-------+
| Insram|26.0|         3| 250000|
|Shakeel|26.0|         4| 256000|
|  Shabi|25.0|         5|2570000|
|    Ali|18.0|         1|  25000|
|  Ahmed|15.0|         1| 150000|
+-------+----+----------+-------+

In [12]:
## how and thresh
df.na.drop(how="any", thresh=2).show()

+-------+----+----------+-------+
|   Name| age|experience| salary|
+-------+----+----------+-------+
| Insram|26.0|         3| 250000|
|Shakeel|26.0|         4| 256000|
|  Shabi|25.0|         5|2570000|
|    Ali|18.0|         1|  25000|
|  Ahmed|15.0|         1| 150000|
|   NULL|45.0|      NULL|  56690|
| Kamran|54.0|      NULL|   NULL|
+-------+----+----------+-------+

In [14]:
## How and subset
df.na.drop(how="any", subset=["salary"]).show()

+-------+----+----------+-------+
|   Name| age|experience| salary|
+-------+----+----------+-------+
| Insram|26.0|         3| 250000|
|Shakeel|26.0|         4| 256000|
|  Shabi|25.0|         5|2570000|
|    Ali|18.0|         1|  25000|
|  Ahmed|15.0|         1| 150000|
|   NULL|45.0|      NULL|  56690|
|   NULL|NULL|      NULL|  90000|
+-------+----+----------+-------+

In [17]:
## Fill null values
df.na.fill(0).show()

+-------+----+----------+-------+
|   Name| age|experience| salary|
+-------+----+----------+-------+
| Insram|26.0|         3| 250000|
|Shakeel|26.0|         4| 256000|
|  Shabi|25.0|         5|2570000|
|    Ali|18.0|         1|  25000|
|  Ahmed|15.0|         1| 150000|
|   NULL|45.0|         0|  56690|
| Kamran|54.0|         0|      0|
|   NULL| 0.0|         0|  90000|
+-------+----+----------+-------+

In [18]:
## Set imputer for numeric columns
from pyspark.ml.feature import Imputer
columns = ["age", "experience", "salary"]
imputer = Imputer(inputCols=columns, outputCols=["{}_imputed".format(c) for c in columns]).setStrategy("mean")

In [19]:
## imputer fit and transform
imputer.fit(df).transform(df).show()

+-------+----+----------+-------+------------------+------------------+--------------+
|   Name| age|experience| salary|       age_imputed|experience_imputed|salary_imputed|
+-------+----+----------+-------+------------------+------------------+--------------+
| Insram|26.0|         3| 250000|              26.0|                 3|        250000|
|Shakeel|26.0|         4| 256000|              26.0|                 4|        256000|
|  Shabi|25.0|         5|2570000|              25.0|                 5|       2570000|
|    Ali|18.0|         1|  25000|              18.0|                 1|         25000|
|  Ahmed|15.0|         1| 150000|              15.0|                 1|        150000|
|   NULL|45.0|      NULL|  56690|              45.0|                 2|         56690|
| Kamran|54.0|      NULL|   NULL|              54.0|                 2|        485384|
|   NULL|NULL|      NULL|  90000|29.857142857142858|                 2|         90000|
+-------+----+----------+-------+------------------+------------------+--------------+